{
  "cards": [
	{
	  "name": "The Fool",
	  "number": 0,
	  "image_path": "res://art/cards/the_fool.png",
	  "interpretations": [
		{
		  "text": "Encourage a leap of faith. Tell them to embrace blissful ignorance and trust the universe with boundless hope.",
		  "effects": {"Hope": 60, "Impulsivity": 40, "Rationality": -50, "Anxiety": -30}
		},
		{
		  "text": "Warn them of recklessness. Their spontaneity is bordering on dangerous naivety; advise a heavy dose of realism.",
		  "effects": {"Impulsivity": -50, "Rationality": 60, "Anxiety": 30}
		},
		{
		  "text": "Focus on the beginning of the journey. This is a fresh start, a chance to boost their confidence for the road ahead.",
		  "effects": {"Confidence": 50, "Hope": 40, "Resilience": 20}
		},
		{
		  "text": "Advise them to be wary of deception. Their trusting nature could be seen as foolishness by those with cynical hearts.",
		  "effects": {"Trust": -40, "Cynicism": 50, "Rationality": 20}
		},
		{
		  "text": "Suggest they embrace the unknown with social abandon. New journeys bring new friends if they are sociable and open.",
		  "effects": {"Sociability": 60, "Impulsivity": 30, "Trust": 20}
		},
		{
		  "text": "Interpret their innocence as a pure form of spirituality, unburdened by cynical world-views.",
		  "effects": {"Spirituality": 50, "Cynicism": -40, "Hope": 20}
		},
		{
		  "text": "Frame their journey as one of patient self-discovery, not a frantic, impulsive scramble.",
		  "effects": {"Patience": 40, "Impulsivity": -30, "Spirituality": 20}
		},
		{
		  "text": "Caution them that their 'leap of faith' could lead to a disastrous fall. Stoke their anxiety to keep them from the edge.",
		  "effects": {"Anxiety": 70, "Hope": -60, "Confidence": -40, "Impulsivity": -20}
		}
	  ]
	},
	{
	  "name": "The Magician",
	  "number": 1,
	  "image_path": "res://art/cards/the_magician.png",
	  "interpretations": [
		{
		  "text": "Empower them. Remind them they have all the tools; they just need the ambition and confidence to manifest their will.",
		  "effects": {"Ambition": 60, "Confidence": 50, "Hope": 20}
		},
		{
		  "text": "Warn of manipulation. A skilled, charismatic person may be using their power for selfish ends; foster a healthy cynicism.",
		  "effects": {"Cynicism": 60, "Trust": -50, "Anxiety": 20}
		},
		{
		  "text": "Focus on their untapped potential. Urge them to apply rational thought and discipline to turn their raw talent into real skill.",
		  "effects": {"Rationality": 50, "Ambition": 30, "Patience": 20}
		},
		{
		  "text": "Interpret the card as a sign of pure willpower. Boost their resilience and determination to see a project through to the end.",
		  "effects": {"Resilience": 60, "Confidence": 40, "Patience": -20}
		},
		{
		  "text": "Advise them to use their powers of communication. A sociable, empathetic approach will win more allies than brute force.",
		  "effects": {"Sociability": 50, "Empathy": 40}
		},
		{
		  "text": "Caution against 'analysis paralysis'. They have the power, but are thinking too much. Urge an impulsive, decisive action.",
		  "effects": {"Impulsivity": 50, "Rationality": -40, "Confidence": 20}
		},
		{
		  "text": "Suggest that true magic comes from a spiritual source. Encourage them to align their actions with their spiritual beliefs.",
		  "effects": {"Spirituality": 60, "Ambition": 20, "Rationality": -20}
		},
		{
		  "text": "Frame their power as an illusion. Tell them that their confidence is unfounded and a dose of anxious realism is needed.",
		  "effects": {"Confidence": -70, "Anxiety": 50, "Realism": 40}
		}
	  ]
	},
	{
	  "name": "The High Priestess",
	  "number": 2,
	  "image_path": "res://art/cards/the_high_priestess.png",
	  "interpretations": [
		{
		  "text": "Urge them to trust their intuition. Tell them the rational mind can't solve this; the answer lies in their subconscious and spiritual insight.",
		  "effects": {"Spirituality": 70, "Rationality": -60, "Trust": 30}
		},
		{
		  "text": "Warn them of secrets and hidden information. Not all is as it seems. Encourage a healthy dose of suspicion and cynicism.",
		  "effects": {"Cynicism": 50, "Trust": -60, "Anxiety": 30}
		},
		{
		  "text": "Advise patience and withdrawal. This is a time for quiet introspection, not sociable or impulsive action.",
		  "effects": {"Patience": 60, "Sociability": -50, "Impulsivity": -40}
		},
		{
		  "text": "Focus on the hidden knowledge. Tell them to look past the surface and use their analytical mind to uncover what is being concealed.",
		  "effects": {"Rationality": 50, "Cynicism": 30}
		},
		{
		  "text": "Interpret the silence as a sign of inner peace. Boost their resilience by showing them the strength found in quiet contemplation.",
		  "effects": {"Resilience": 40, "Anxiety": -50, "Patience": 30}
		},
		{
		  "text": "Caution against becoming too withdrawn. Their introspection is turning into lonely, anxious isolation.",
		  "effects": {"Sociability": 40, "Anxiety": 30, "Spirituality": -20}
		},
		{
		  "text": "Tell them to embrace the mystery of the unknown with hope, rather than fearing it with anxiety.",
		  "effects": {"Hope": 50, "Anxiety": -40, "Spirituality": 20}
		},
		{
		  "text": "Suggest their intuition is clouded by emotional turmoil. A clear, rational mind is needed to see the truth.",
		  "effects": {"Rationality": 60, "Spirituality": -50, "Patience": 20}
		}
	  ]
	},
	{
	  "name": "The Emperor",
	  "number": 4,
	  "image_path": "res://art/cards/the_emperor.png",
	  "interpretations": [
		{
		  "text": "Advise them to take absolute control. A disciplined, rational plan is the only way to establish order and achieve their ambitions.",
		  "effects": {"Rationality": 50, "Ambition": 40, "Confidence": 20, "Impulsivity": -30}
		},
		{
		  "text": "Warn them that their rigid control is becoming tyranny. Urge them to show empathy, or their empire will crumble from within.",
		  "effects": {"Empathy": 60, "Rationality": -40, "Ambition": -20}
		},
		{
		  "text": "Encourage them to build a solid foundation, brick by brick. This is not a time for impulse, but for immense patience and structure.",
		  "effects": {"Patience": 60, "Rationality": 40, "Impulsivity": -50}
		},
		{
		  "text": "Tell them to suppress their emotions. A cold, logical, and even cynical perspective is necessary to maintain authority.",
		  "effects": {"Rationality": 60, "Empathy": -70, "Cynicism": 40}
		},
		{
		  "text": "Remind them that they ARE the authority in their own life. Boost their confidence to be a firm, decisive leader.",
		  "effects": {"Confidence": 70, "Ambition": 30, "Anxiety": -30}
		},
		{
		  "text": "Warn against the chaos of impulsivity. A structured life leaves no room for reckless action; advise them to be deliberate.",
		  "effects": {"Impulsivity": -60, "Patience": 50, "Rationality": 20}
		},
		{
		  "text": "Push them to embrace their inner tyrant. Tell them that their ambition justifies a lack of empathy for those who stand in their way.",
		  "effects": {"Ambition": 70, "Empathy": -80, "Cynicism": 50}
		},
		{
		  "text": "Advise that they have lost control and are acting with desperate impulsivity. They need to restore order immediately.",
		  "effects": {"Rationality": 50, "Patience": 30, "Impulsivity": -40, "Anxiety": 20}
		}
	  ]
	},
	{
	  "name": "Death",
	  "number": 13,
	  "image_path": "res://art/cards/death.png",
	  "interpretations": [
		{
		  "text": "Frame this as a necessary, cleansing end. Encourage them to find hope in the new beginning this ending makes possible.",
		  "effects": {"Hope": 70, "Anxiety": -50, "Resilience": 30}
		},
		{
		  "text": "Warn them that resisting this inevitable change will only cause more pain. Their anxiety is a chain; letting go is freedom.",
		  "effects": {"Resilience": 50, "Anxiety": -40, "Hope": 20, "Patience": 20}
		},
		{
		  "text": "Interpret this as a spiritual transformation. The old self is dying, so they can boost their confidence and be reborn.",
		  "effects": {"Spirituality": 60, "Confidence": 50, "Hope": 30}
		},
		{
		  "text": "Advise them to be ruthlessly rational. This is a time to cut away what is no longer working, without sentiment or emotion.",
		  "effects": {"Rationality": 70, "Empathy": -50, "Hope": -30}
		},
		{
		  "text": "Focus on the deep, unavoidable grief of this ending. It is okay to be sad; tell them not to rush the healing process.",
		  "effects": {"Patience": 50, "Anxiety": 30, "Hope": -40}
		},
		{
		  "text": "Caution them against making impulsive decisions in the wake of this ending. Advise patience and careful thought.",
		  "effects": {"Impulsivity": -60, "Patience": 50, "Rationality": 30}
		},
		{
		  "text": "Tell them this ending is a total loss. There is no silver lining. Encourage them to embrace their cynicism and despair.",
		  "effects": {"Hope": -80, "Cynicism": 60, "Anxiety": 40}
		},
		{
		  "text": "Focus on the resilience needed to endure this. Remind them that they have survived endings before and will again.",
		  "effects": {"Resilience": 70, "Confidence": 30, "Hope": 20}
		}
	  ]
	}
  ]
}
